[
    {   
        "name" : "post2",
        "title" : "GDP of Countries Visualization",
        "time" : "3 minutes",
        "content" : "In today's interconnected world, grasping the dynamics of global economic growth is a captivating pursuit. Gross Domestic Product (GDP), a key measure of a nation's economic performance, takes on even greater significance in this context. Through visualization, we're able to explore GDP's patterns and fluctuations, gaining valuable insights into different economies and their interplay. This blog delves into the realm of GDP visualization, offering a unique perspective on the intricate world of economics.",
        "img" : "../../Images/article2.png"
    },
    {
        "name": "post1",
        "title": "From thought to action",
        "time": "5 minutes",
        "content": "I've been thinking about starting a blog for some time now. Counting my otherwise focused blog, it's actually been a seriously long time. Since I've decided to redo my portfolio, it seemed like the perfect time to incorporate it directly into the new one. It will actually be a form of showcase of my work in itself, albeit in a slightly unconventional form.\n\nThe main reason I have the desire and need to start writing is that I would like to move my enthusiasm for data visualization from the theoretical to the practical. Pretty visualizations of various data used to be a daily content on my social media bulletin boards (I try not to use them nowadays). But I would like to start making similar creations myself. After all, working with data and then visualizing it was the basis of my thesis and it brought me back to programming.\n\nMy own creations are limited to charts created in Excel and Paste, which has served its purpose, but it is hardly a miracle. Through programming, however, it is possible to create complex and interactive graphs that make the data more understandable and clear. Such custom visualizations will also allow you to interact with the chart environment and, for example, change the displayed data, again improving the viewing experience.\n\nThere are several ways to create such visualizations. I would like to focus on a combination of React and the JavaScript library D3. It is the combination of the two that creates a very powerful tool that allows you to create an unlimited variety of outputs, it's up to you and your data.\n\nHowever, writing code in this library is specific and requires some learning. Anyway, that's the main reason I'm breaking it down here. I'd like to document this journey of mine, and maybe this will help someone who would also like to get started. After all, it is said that sometimes a beginner is the best person to explain a problem to a beginner.\n\nI would like to focus on working with different datasets, each of which is suitable for a different type of processing. I myself am very curious to see what all I can create. Occasionally, I would also like to write a post regarding other, but related, topics that are close to my heart and might be of interest to someone. But I'm getting ahead of myself. But without further ado, let's get to it!\n",
        "img": "../../Images/article1.jpg"
      }      
]
